{
    "version": "https://jsonfeed.org/version/1",
    "title": "Machine Learning &amp; Partial Differential Equations",
    "description": "",
    "home_page_url": "https://jmmachadol.github.io/blog_ml-pde",
    "feed_url": "https://jmmachadol.github.io/blog_ml-pde/feed.json",
    "user_comment": "",
    "author": {
        "name": "Jose Manuel Machado-Loaiza"
    },
    "items": [
        {
            "id": "https://jmmachadol.github.io/blog_ml-pde/how-to-do-a-literature-review-my-experience-in-reviewing-the-physics-informed-neural-networks-literature-and-some-practical-advice.html",
            "url": "https://jmmachadol.github.io/blog_ml-pde/how-to-do-a-literature-review-my-experience-in-reviewing-the-physics-informed-neural-networks-literature-and-some-practical-advice.html",
            "title": "My experience doing a literature review: some practical advice",
            "summary": "A literature review is an essential component of any research project, as it provides an overview of the current state of knowledge in a particular field. By identifying, selecting, and evaluating relevant literature, a literature review helps to establish the context of a research topic&hellip;",
            "content_html": "<p>A literature review is an essential component of any research project, as it provides an overview of the current state of knowledge in a particular field. By identifying, selecting, and evaluating relevant literature, a literature review helps to establish the context of a research topic and to identify gaps in the existing body of knowledge.</p>\n<h6>What is Literature?</h6>\n<p>When we talk about literature, we are referring to the works that researchers consult to understand and investigate a particular field. This can include academic books, professional journals, conference proceedings, theses, research reports, and electronic databases. Literature reviews are also useful for identifying other works by the same researchers, which can help to build a more comprehensive understanding of a particular research topic.</p>\n<h6>The Benefits of a Literature Review</h6>\n<p>A good literature review can help to answer important questions about a research topic, such as why it is necessary to study a particular problem and what assumptions need to be tested. By providing a historical context for a research topic, a literature review can also help to establish the importance of a particular problem and identify gaps in existing research. Furthermore, by summarizing and integrating individual findings, a literature review can help to address broader, integrative questions about a particular topic.</p>\n<h6>Steps for Conducting a Literature Review</h6>\n<p>There are several key steps involved in conducting a literature review:</p>\n<ol>\n<li>\n<p class=\"dropcap\">Scoping: This involves familiarizing oneself with the literature, identifying research questions, and identifying important contributions to scientific knowledge.</p>\n</li>\n<li>\n<p class=\"dropcap\">Planning: Once research questions have been identified, the search criteria are established. This includes considerations such as terminology, research design, target audience, and time frame.</p>\n</li>\n<li>\n<p class=\"dropcap\">Searching: Databases such as Scopus, Google Scholar, arXiv, Web of Science, Research Rabbit, and Connected Papers are used to find papers related to the research field.</p>\n</li>\n<li>\n<p class=\"dropcap\">Screening: A bibliographic manager, such as Zotero, is used to keep track of references and citation managers. Files and directories are named using appropriate naming conventions, such as using an underscore to separate the year of publication, authors, and title.</p>\n</li>\n<li>\n<p class=\"dropcap\">Eligibility: Relationships with other published works are established, and the validity of assumptions and the contribution of the articles are considered.</p>\n</li>\n</ol>\n<p><span style=\"color: var(--text-primary-color); font-family: var(--editor-font-family); font-size: inherit; font-weight: var(--font-weight-normal);\">Therefore, literature reviews are an essential component of any research project. By providing an overview of the existing state of knowledge in a particular field, literature reviews help to establish the context of a research topic, identify gaps in existing research, and address broader, integrative questions about a particular topic. By following the steps outlined above, researchers can ensure that their literature reviews are comprehensive, rigorous, and useful for building knowledge in their chosen field.</span></p>\n<p> </p>\n<p> </p>\n<p> </p>\n<p> </p>\n<p> </p>",
            "author": {
                "name": "Jose Manuel Machado-Loaiza"
            },
            "tags": [
            ],
            "date_published": "2023-02-19T13:29:58-05:00",
            "date_modified": "2023-02-19T13:34:59-05:00"
        }
    ]
}
