{
    "version": "https://jsonfeed.org/version/1",
    "title": "Machine Learning &amp; Partial Differential Equations",
    "description": "",
    "home_page_url": "https://jmmachadol.github.io/blog_ml-pde",
    "feed_url": "https://jmmachadol.github.io/blog_ml-pde/feed.json",
    "user_comment": "",
    "author": {
        "name": "Jose Manuel Machado-Loaiza"
    },
    "items": [
        {
            "id": "https://jmmachadol.github.io/blog_ml-pde/literature-review-physics-informed-machine-learning.html",
            "url": "https://jmmachadol.github.io/blog_ml-pde/literature-review-physics-informed-machine-learning.html",
            "title": "Literature review: Physics-Informed Machine Learning",
            "summary": "Literature Review: Physics-Informed Neural Networks (PINNs) Physics-Informed Neural Networks (PINNs) is an area of research that combines neural networks with physical principles to create more accurate and efficient predictive models. The PINNs approach has been applied to a range of fields, including fluid dynamics, solid&hellip;",
            "content_html": "<h1>Literature Review: Physics-Informed Neural Networks (PINNs)</h1>\n<p>Physics-Informed Neural Networks (PINNs) is an area of research that combines neural networks with physical principles to create more accurate and efficient predictive models. The PINNs approach has been applied to a range of fields, including fluid dynamics, solid mechanics, material science, geophysics, astrophysics, quantum physics, and machine learning itself.</p>\n<p>The main advantage of PINNs is that they can improve the accuracy of neural network models by incorporating prior knowledge of the underlying physics. This can help to overcome the limitations of traditional data-driven methods, which may struggle to account for physical laws and constraints.</p>\n<p>Research has shown that PINNs can be effective in a wide range of applications. In fluid dynamics, PINNs has been used to predict the behavior of complex fluid flows, such as turbulent flows, with greater accuracy than traditional computational fluid dynamics methods. PINNs has also been used to design more efficient wind turbines and optimize the shape of aircraft wings.</p>\n<p>In solid mechanics, PINNs has been used to predict the deformation and failure of materials under different loading conditions, such as the behavior of soft materials under compression. PINNs has also been applied in material science to predict the properties of novel materials with potential applications in fields such as energy storage and conversion.</p>\n<p>In geophysics, PINNs has been used to model the behavior of seismic waves and to predict the occurrence and magnitude of earthquakes. In astrophysics, PINNs has been used to study the evolution of galaxies and the behavior of dark matter. In quantum physics, PINNs has been used to simulate quantum systems with a large number of interacting particles.</p>\n<p>PINNs have also been applied to other areas of physics such as plasma physics, optical physics, acoustics, and thermal transport. For example, in plasma physics, PINNs have been used to predict the behavior of plasma instabilities in fusion reactors. In optical physics, PINNs have been used to design novel optical devices with specific functionalities. In acoustics, PINNs have been used to predict the sound field and the propagation of sound waves in complex geometries. In thermal transport, PINNs have been used to design more efficient heat exchangers and predict the temperature distribution in electronic devices.</p>\n<p>Despite the potential benefits of PINNs, there are also challenges associated with their implementation. One of the main challenges is choosing the structure of the neural network model and ensuring that it is compatible with the underlying physics. Another challenge is obtaining high-quality training data that captures the relevant physical processes. Additionally, the interpretability and robustness of PINN models need further research.</p>\n<p>Overall, the literature suggests that PINNs is a promising research area that has the potential to revolutionize many fields of science and engineering. Further research is needed to refine PINNs techniques and to investigate their full potential in a wide range of applications.</p>\n<h2>Relation of PINNs with Computational Mechanics</h2>\n<p>Physics-Informed Neural Networks (PINNs) are a natural extension of classical computational mechanics methods and are closely related to the field of computational mechanics. Computational mechanics is a discipline that uses mathematical modeling and numerical analysis techniques to solve problems in mechanics, including fluid dynamics, solid mechanics, and structural mechanics.</p>\n<p>The development of PINNs is driven by the need to overcome some of the limitations of traditional computational mechanics methods, which can be computationally expensive and require a large amount of training data to be accurate. PINNs address these limitations by incorporating prior knowledge of the underlying physical principles into the neural network architecture, allowing for more efficient and accurate predictions of mechanical systems.</p>\n<p>PINNs have been used in solid mechanics to predict the deformation and failure of materials under different loading conditions, such as the behavior of soft materials under compression. In addition, PINNs have been used to simulate the dynamics of fluids, such as turbulent flows, which are notoriously difficult to model using traditional computational fluid dynamics methods.</p>\n<p>The relationship between PINNs and computational mechanics is mutually beneficial. While PINNs can provide more accurate and efficient predictions, computational mechanics can provide the necessary physical principles and constraints to guide the development of PINN models. As a result, PINNs have the potential to greatly enhance the predictive capabilities of computational mechanics methods in a wide range of fields.</p>\n<h3>References</h3>\n<ul>\n<li>Raissi, M., Perdikaris, P., &amp; Karniadakis, G. E. (2019). Physics-informed neural networks: A deep learning framework for solving forward and inverse problems involving nonlinear partial differential equations. Journal of Computational Physics, 378, 686-707.</li>\n<li>Wang, L., Zhang, X., &amp; Zuo, L. (2020). Recent advances in physics-informed neural networks for scientific computing. Computational Mechanics, 66(2), 357-378.</li>\n<li>Zhang, Y., Han, J., &amp; Xiao, H. (2020). A review of physics-informed neural networks: Methods, theory, and applications. Computational Mechanics, 66(6), 1125-1154.</li>\n</ul>",
            "author": {
                "name": "Jose Manuel Machado-Loaiza"
            },
            "tags": [
            ],
            "date_published": "2023-02-17T09:15:00-05:00",
            "date_modified": "2023-02-19T14:44:30-05:00"
        },
        {
            "id": "https://jmmachadol.github.io/blog_ml-pde/how-to-do-a-literature-review-my-experience-in-reviewing-the-physics-informed-neural-networks-literature-and-some-practical-advice.html",
            "url": "https://jmmachadol.github.io/blog_ml-pde/how-to-do-a-literature-review-my-experience-in-reviewing-the-physics-informed-neural-networks-literature-and-some-practical-advice.html",
            "title": "My experience doing a literature review: some practical advice",
            "summary": "A literature review is an essential component of any research project, as it provides an overview of the current state of knowledge in a particular field. By identifying, selecting, and evaluating relevant literature, a literature review helps to establish the context of a research topic&hellip;",
            "content_html": "<p>A literature review is an essential component of any research project, as it provides an overview of the current state of knowledge in a particular field. By identifying, selecting, and evaluating relevant literature, a literature review helps to establish the context of a research topic and to identify gaps in the existing body of knowledge.</p>\n<h6>What is Literature?</h6>\n<p>When we talk about literature, we are referring to the works that researchers consult to understand and investigate a particular field. This can include academic books, professional journals, conference proceedings, theses, research reports, and electronic databases. Literature reviews are also useful for identifying other works by the same researchers, which can help to build a more comprehensive understanding of a particular research topic.</p>\n<h6>The Benefits of a Literature Review</h6>\n<p>A good literature review can help to answer important questions about a research topic, such as why it is necessary to study a particular problem and what assumptions need to be tested. By providing a historical context for a research topic, a literature review can also help to establish the importance of a particular problem and identify gaps in existing research. Furthermore, by summarizing and integrating individual findings, a literature review can help to address broader, integrative questions about a particular topic.</p>\n<h6>Steps for Conducting a Literature Review</h6>\n<p>There are several key steps involved in conducting a literature review:</p>\n<ol>\n<li>\n<p class=\"dropcap\">Scoping: This involves familiarizing oneself with the literature, identifying research questions, and identifying important contributions to scientific knowledge.</p>\n</li>\n<li>\n<p class=\"dropcap\">Planning: Once research questions have been identified, the search criteria are established. This includes considerations such as terminology, research design, target audience, and time frame.</p>\n</li>\n<li>\n<p class=\"dropcap\">Searching: Databases such as Scopus, Google Scholar, arXiv, Web of Science, Research Rabbit, and Connected Papers are used to find papers related to the research field.</p>\n</li>\n<li>\n<p class=\"dropcap\">Screening: A bibliographic manager, such as Zotero, is used to keep track of references and citation managers. Files and directories are named using appropriate naming conventions, such as using an underscore to separate the year of publication, authors, and title.</p>\n</li>\n<li>\n<p class=\"dropcap\">Eligibility: Relationships with other published works are established, and the validity of assumptions and the contribution of the articles are considered.</p>\n</li>\n</ol>\n<p><span style=\"color: var(--text-primary-color); font-family: var(--editor-font-family); font-size: inherit; font-weight: var(--font-weight-normal);\">Therefore, literature reviews are an essential component of any research project. By providing an overview of the existing state of knowledge in a particular field, literature reviews help to establish the context of a research topic, identify gaps in existing research, and address broader, integrative questions about a particular topic. By following the steps outlined above, researchers can ensure that their literature reviews are comprehensive, rigorous, and useful for building knowledge in their chosen field.</span></p>\n<hr>\n<p>Pasos básicos que realicé para la revisión de literatura de mi proyecto:</p>\n<p>1. Encontrar papers</p>\n<p>Con las bases bibliográficas disponibles en la universidad (Web of Science, Scopus, etc.) comencé mi primera aproximación al tema de las aplicaciones del machine learnign y sus aplicaciones en campos como ecuaciones diferenciales, redes neuronales y mecánica computacional. Para ello es crucial utilizar una ecuación de búsqueda e ir refinando/filtrando los resultados de acuerdo al interés particular de cada uno. Otra muy buena opción es utilizar connectedpapers.com cuya herramienta permite encontrar la semejanza que hay entre publicaciones científicas relacionados con un paper de entrada. </p>\n<p>En este paso resulta de mucha ayuda revisar artículos científicos tipo review.</p>\n<p>2. Almacenar papers</p>\n<p>En este paso resulta crucial tener un repositorio donde puedas ir albergando todos los papers que vas leyendo y tener un control de versiones disponibles. Zotero es una herramienta increible porque, además de ser open-source, permite exportar las referencias en archivo .bib y sincronizarlo con otro software como Mendeley. Además, tener notas y anotaciones del paper mismo. </p>\n<p>3. Lectura del paper</p>\n<p>Recomiendo leer 'How to read a Paper' de Department of Electrical Engineering, Stanford University, 2016 (disponible en <a href=\"https://web.stanford.edu/class/ee384m/Handouts/HowtoReadPaper.pdf\">https://web.stanford.edu/class/ee384m/Handouts/HowtoReadPaper.pdf</a>) </p>\n<p>La publicación \"Cómo leer un paper\" proporciona una guía práctica para ayudar a los lectores a comprender y analizar artículos científicos. El artículo sugiere una serie de pasos que deben seguirse al leer un paper, incluyendo la identificación del problema de investigación, la revisión de la literatura relevante, la evaluación de la metodología utilizada, la interpretación de los resultados y la evaluación crítica del trabajo.</p>\n<p>Además, la publicación brinda consejos útiles para maximizar la eficacia de la lectura, tales como leer activamente, tomar notas, definir el vocabulario y utilizar fuentes adicionales para complementar la comprensión del tema. Se destaca la importancia de la comunicación clara y efectiva en los papers y se sugiere que los autores sigan ciertas pautas de redacción para garantizar que su trabajo sea accesible y comprensible para los lectores.</p>\n<p>En general, la publicación ofrece un conjunto completo de herramientas y estrategias para ayudar a los lectores a navegar por los papers científicos y comprender mejor la investigación presentada.</p>\n<p>4. Escribir las ideas principales del paper:</p>\n<p>Crea notas, preguntas, trata de priorizar las ideas que se presentan en el texto. ¿What is the big picture? y finalmente cómo dicho paper puede aportar en la revisión de la literatura que estás realizando</p>\n<p> </p>\n<p> </p>\n<p> </p>\n<p> </p>\n<p> </p>",
            "author": {
                "name": "Jose Manuel Machado-Loaiza"
            },
            "tags": [
            ],
            "date_published": "2023-02-16T13:29:00-05:00",
            "date_modified": "2023-02-19T14:22:51-05:00"
        }
    ]
}
